tutorials/plastic_cases/hele_shaw_fracturing/U1nu4e-6STD0.1Trial1Case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    walls
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls2
    {
        type            fixedValue;
        value           uniform 0;
    }
    upperInlet
    {
        type            fixedFluxPressure;
    }
    lowerInlet
    {
        type            fixedFluxPressure;
    }
    rightInlet
    {
        type            fixedFluxPressure;
    }
    leftInlet
    {
        type            fixedFluxPressure;
    }
}


// ************************************************************************* //
